In [10]:
import pandas as pd
from sqlalchemy import create_engine

In [11]:
# Define your database connection parameters
db_username = 'postgres'
db_password = 'pass123'
db_host = '127.0.0.1'
db_port = '5432'
db_name = 'test'

In [12]:
# Create the SQLAlchemy engine
engine = create_engine(f'postgresql+psycopg2://{db_username}:{db_password}@{db_host}:{db_port}/{db_name}')

In [13]:
df_notes = pd.read_sql(f'SELECT * FROM public.notes', engine)
df_notes

              id  note
0              1  10.3
1              1   9.7
2              2  11.1
3              2  12.9
4              1  20.0
...          ...   ...
1999996   999996   7.0
1999997   999997   7.0
1999998   999998   7.0
1999999   999999   7.0
2000000  1000000   7.0

[2000001 rows x 2 columns]

In [16]:
def transfo_notes(note):
    if note < 10:
        return note + 0.1
    return note

df_notes = df_notes['note'].apply(transfo_notes).reset_index()
display(df_notes)

           index  note
0              0  10.3
1              1   9.8
2              2  11.1
3              3  12.9
4              4  20.0
...          ...   ...
1999996  1999996   7.1
1999997  1999997   7.1
1999998  1999998   7.1
1999999  1999999   7.1
2000000  2000000   7.1

[2000001 rows x 2 columns]

In [17]:
# Sauvegarde dans Excel les 100 premières lignes
df_notes.head(100).to_excel("output_notes.xlsx")